Repository: fbeauKmi/GRBL-Plotter
Catalog: KPolar/GCodeCreation/CreateFromForm/GCodeFromText.*.resx
Languages: ar, ru

# label11.Text
source: Line distance
ar: خط المسافة
ru: межстрочный интервал

# label3.Text
source: Tool:
ar: الأداة:
ru: Инструмент:

# label10.Text
source: Letter distance
ar: مسافة الرسالة
ru: Расстояние до буквы

# cBPauseWord.Text
source: Add Pause before word
ar: إضافة وقفة قبل كلمة
ru: Добавить паузу перед словом

# btnApply.Text
source: Create G-Code
ar: قم بإنشاء G-Code
ru: Создать G-Code

# cBPauseLine.Text
source: Add Pause before Line
ar: إضافة وقفة قبل الخط
ru: Добавить паузу перед строкой

# $this.Text
source: Create G-Code from Text
ar: إنشاء G- رمز من النص
ru: Создать G-Code из текста

# label2.Text
source: Other G-Code settings in Setup SVG-Import
ar: إعدادات G-Code الأخرى في إعداد SVG-Import
ru: Другие настройки G-кода в настройках SVG-Import

# label11.ToolTip
source: Distance between lines
ar: المسافة بين الخطوط
ru: Расстояние между линиями

# btnCancel.Text
source: Close
ar: قريب
ru: близко

# cBConnectLetter.Text
source: Connect letters (only hershey)
ar: ربط الحروف (هيرشي فقط)
ru: Соединяйте буквы (только хершей)

# cBToolTable.ToolTip
source: Within a word connect last point of letter with first point of next letter
ar: داخل كلمة ربط النقطة الأخيرة من الرسالة مع النقطة الأولى من الرسالة التالية
ru: В слове соедините последнюю точку буквы с первой точкой следующей буквы

# label1.Text
source: Letter height
ar: ارتفاع الرسالة
ru: Высота письма

# cBPauseChar.Text
source: Add Pause before letter
ar: إضافة وقفة قبل الرسالة
ru: Добавить паузу перед письмом

# groupBox1.Text
source: G-Code
ar: G-كود
ru: G-код

# cBConnectLetter.ToolTip
source: Within a word connect last point of letter with first point of next letter
ar: داخل كلمة ربط النقطة الأخيرة من الرسالة مع النقطة الأولى من الرسالة التالية
ru: В слове соедините последнюю точку буквы с первой точкой следующей буквы

# label1.ToolTip
source: Height of letters
ar: ارتفاع الحروف
ru: Высота букв

# cBToolTable.Text
source: Get values from tool table
ar: الحصول على القيم من جدول الأدوات
ru: Получить значения из таблицы инструментов

# label10.ToolTip
source: Additional space between letters
ar: مساحة إضافية بين الحروف
ru: Дополнительный пробел между буквами

# tabPage1.Text
source: Text creation
ar: إنشاء النص
ru: Создание текста

# tabPage2.Text
source: Hershey Font information
ar: معلومات الخط
ru: Информация о шрифте

# cBLineBreak.Text
source: Line break after (estimated)
ar: فاصل الأسطر بعد (تقديري)
ru: Разрыв строки после (ориентировочно)

# cBLineBreak.ToolTip
source: Estimates the word length and adds a line break after the specified length
ar: تقدير طول الكلمة وإضافة فاصل أسطر بعد الطول المحدد
ru: Оценивает длину слова и добавляет разрыв строки после указанной длины

# RbAlign3.Text
source: right
ar: إلى اليمين
ru: Направо

# RbAlign2.Text
source: center
ar: المركز
ru: центр

# RbAlign1.Text
source: left
ar: اليسار
ru: Левый

# CbInsertCode.Text
source: Insert text into 2D-view (at position 0;0)
ar: أدخل نصًا في عرض ثنائي الأبعاد (في الموضع 0 ؛ 0)
ru: Вставить текст в 2D-вид (в позиции 0;0)

# CbOutline.Text
source: Outline
ar: الخطوط العريضة
ru: Контур

# CbOutline.ToolTip
source: Fill letters with hatch fill pattern, defined in [Setup - Graphics import - Path import - Path modifications]
ar: تعبئة الأحرف بنمط تعبئة الفتحة المحدد في [الإعداد - استيراد الرسومات - استيراد المسار - تعديلات المسار]
ru: Заполните буквы образцом штриховки, заданным в [Настройка — Импорт графики — Импорт контура — Модификации контура]

# CbHatchFill.Text
source: Hatch fill
ar: ملء هاتش
ru: Заполнение люка

# CbHatchFill.ToolTip
source: Fill letters with hatch fill pattern, defined in [Setup - Graphics import - Path import - Path modifications]
ar: تعبئة الأحرف بنمط تعبئة الفتحة المحدد في [الإعداد - استيراد الرسومات - استيراد المسار - تعديلات المسار]
ru: Заполните буквы образцом штриховки, заданным в [Настройка — Импорт графики — Импорт контура — Модификации контура]

# CbWordWrap.Text
source: Word wrap
ar: التفاف النص
ru: Перенос слова

# RbFont2.Text
source: System font
ar: خط النظام
ru: Системный шрифт

# RbFont1.Text
source: Single-line font (Hershey)
ar: خط أحادي الخط (هيرشي)
ru: Однострочный шрифт (Hershey)

# groupBox2.Text
source: Text alignment
ar: محاذاة النص
ru: Выравнивание текста

# BtnSelectFont.Text
source: Select font
ar: حدد الخط
ru: Выберите шрифт

# LblFont.Text
source: Font:
ar: الخط:
ru: Шрифт:

# LblInfoFont.Text
source: Font
ar: الخط
ru: Шрифт

# LblInfoSize.Text
source: Size
ar: بحجم
ru: Размер

# LblSize.Text
source: Size:
ar: بحجم:
ru: Размер:

# LblWidth.Text
source: Width:
ar: عرض:
ru: Ширина:

# LblHeight.Text
source: Height:
ar: ارتفاع:
ru: Рост:

# LblInfoWidth.ToolTip
source: Text width of created G-Code with current font-size and word wrap setting
ar: عرض نص G-Code الذي تم إنشاؤه مع حجم الخط الحالي وإعداد التفاف النص
ru: Ширина текста созданного G-кода с текущим размером шрифта и настройкой переноса слов

# LblInfoHeight.ToolTip
source: Text height of created G-Code with current font-size and word wrap setting
ar: ارتفاع نص G-Code الذي تم إنشاؤه باستخدام حجم الخط الحالي وإعداد التفاف النص
ru: Высота текста созданного G-кода с текущим размером шрифта и настройкой переноса слов

# linkLabel1.Text
source: Free fonts
ar: الخطوط المجانية
ru: Бесплатные шрифты

# linkLabel1.ToolTip
source: Link to 'www.dafont.com' - usage is on your own risk.
ar: رابط "www.dafont.com" - الاستخدام على مسؤوليتك الخاصة.
ru: Ссылка на 'www.dafont.com' - использование на свой страх и риск.

# NUDWidth.ToolTip
source: Set desired text width and adapt font-size to reach it.
ar: قم بتعيين عرض النص المطلوب وتكييف حجم الخط للوصول إليه.
ru: Установите желаемую ширину текста и адаптируйте размер шрифта для ее достижения.

# NUDHeight.ToolTip
source: Set desired text height and adapt font-size to reach it.
ar: قم بتعيين ارتفاع النص المطلوب وتكييف حجم الخط للوصول إليه.
ru: Установите желаемую высоту текста и адаптируйте размер шрифта для ее достижения.

# BtnSetWidth.Text
source: set
ar: تعيين
ru: установлен

# BtnSetWidth.ToolTip
source: Calculate and set font-size to reach given text width
ar: حساب وضبط حجم الخط للوصول إلى عرض نص معين
ru: Рассчитать и установить размер шрифта для достижения заданной ширины текста

# BtnSetHeight.Text
source: set
ar: تعيين
ru: установлен

# BtnSetHeight.ToolTip
source: Calculate and set font-size to reach given text height
ar: حساب وتعيين حجم الخط للوصول إلى ارتفاع النص المحدد
ru: Рассчитать и установить размер шрифта для достижения заданной высоты текста

# BtnSaveIni.ToolTip
source: Save settings of this window as INI file
ar: يحفظ إعدادات هذه النافذة كملف INI
ru: Сохраняет настройки этого окна в виде INI-файла.

# BtnHelp.ToolTip
source: Online help
ar: مساعدة على الانترنت
ru: Онлайн помощь

# cBImportGraphicNoise.Text
source: Add noise
ar: زد الضوضاء
ru: Добавлять шум

# cBImportGraphicNoise.ToolTip
source: Generate wobbly lines, settings in [Setup - Graphics import - Path import - Path modifications]
ar: يُنشئ خطوطًا متذبذبة، وإعدادات في [الإعداد - استيراد الرسومات - استيراد المسار - تعديلات المسار]
ru: Генерирует шаткие линии, настройки в [Настройка - Импорт графики - Импорт пути - Изменение пути]
